Процедура ОбработкаПроведения(Отказ,Режим)

    ОстатковХватает  = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос();
    Запрос.Текст = "ВЫБРАТЬ
    |	РасходТоваровТовары.Номенклатура КАК Номенклатура,
    |	СУММА(РасходТоваровТовары.Количество) КАК Количество
    |ИЗ
    |	Документ.РасходТоваров.Товары КАК РасходТоваровТовары
    |ГДЕ
    |	РасходТоваровТовары.Ссылка = &СсылкаДокумента
    |СГРУППИРОВАТЬ ПО
    |	РасходТоваровТовары.Номенклатура";
    Запрос.УстановитьПараметр("СсылкаДокумента", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    Если РезультатЗапроса.Пустой() Тогда
    	Возврат
    КонецЕсли;
    
    // Проведение документа
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
    	
    	Отбор = Новый Структура();
    	Отбор.Вставить("Склад", Склад);
    	Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
    	ОстаткиТЗ = РегистрыНакопления.ОстаткиНоменклатуры.Остатки(, Отбор);
    	ОстатокПоНоменклатуре = ОстаткиТЗ[0].Количество;
    	
    	Если ОстатокПоНоменклатуре < Выборка.Количество Тогда // контроль остатков
    		ОстатковХватает = Ложь;
    		Сообщить("Для номенклатуры " + Выборка.Номенклатура 
    		         + " нельзя провести: " + Строка(Выборка.Количество) 
    		         + " так как в запасах только: " + Строка(ОстатокПоНоменклатуре));
    	КонецЕсли;
 
    	Движение              = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад        = Склад;
		Движение.Количество   = Выборка.Количество;
    КонецЦикла;
    
    // Не проводим документ если не хватает остатков хотя бы по одной номенклатуре
	Отказ = ?(ОстатковХватает, Ложь, Истина);

КонецПроцедуры