Функция ПолучитьРозничнуюЦену(Номенклатура, Дата) Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ЦенаНоменклатурыНаДату = РегистрыСведений.Цена.ПолучитьПоследнее(Дата,Отбор);
	Возврат ЦенаНоменклатурыНаДату.Цена;
	
//	Запрос = Новый Запрос();
//	Запрос.Текст = "ВЫБРАТЬ
//	|	спрЦена.Цена КАК Цена
//	|ИЗ
//	|	РегистрСведений.Цена КАК спрЦена
//	|ГДЕ
//	|	спрЦена.Номенклатура = &Номенклатура
//	|	И спрЦена.Период <= &Период
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	спрЦена.Период УБЫВ";
//	
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("Период", Дата);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если РезультатЗапроса = Неопределено Тогда
//		Возврат 0;
//	КонецЕсли;
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	Выборка.Следующий();
//	
//	Возврат Выборка.Цена;
КонецФункции
