Процедура ОбработкаПроведения(Отказ,Режим)
    
    Движения.ОстаткиНоменклатуры.Записывать = Истина;
    
    Запрос = Новый Запрос();
    Запрос.Текст = "ВЫБРАТЬ
    |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
    |	СУММА(ПоступлениеТоваровТовары.Количество) КАК Количество
    |ИЗ
    |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
    |ГДЕ
    |	ПоступлениеТоваровТовары.Ссылка = &СсылкаДокумента
    |СГРУППИРОВАТЬ ПО
    |	ПоступлениеТоваровТовары.Номенклатура";
    Запрос.УстановитьПараметр("СсылкаДокумента", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    Если РезультатЗапроса.Пустой() Тогда
    	Возврат
    КонецЕсли;
    
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
    	Движение              = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
		Движение.Период       = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад        = Склад;
		Движение.Количество   = Выборка.Количество;
    КонецЦикла;
    

КонецПроцедуры