&НаКлиенте
перем ПредНоменклатура;

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)           // Изменение поля "Количество"
	
	ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	КлиентРаботаСДокументами.РассчитатьСумму(ТекущаяСтрокаТовары); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)                 // Изменение поля "Цена"
	
	ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	КлиентРаботаСДокументами.РассчитатьСумму(ТекущаяСтрокаТовары); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)         // Изменение поля "Номенклатура"
	
	ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрокаТовары.Цена = 
		СерверРаботаСДокументами.ПолучитьРозничнуюЦену(ТекущаяСтрокаТовары.Номенклатура, 
		                                               Объект.Дата);  
    Если ПредНоменклатура <> Неопределено И 
         ПредНоменклатура <> ТекущаяСтрокаТовары.Номенклатура Тогда
         	
    	КлиентРаботаСДокументами.РассчитатьСумму(ТекущаяСтрокаТовары); 
    КонецЕсли;
    
    ПредНоменклатура = ТекущаяСтрокаТовары.Номенклатура;
    	                                                                                           
КонецПроцедуры



